In [52]:
import pandas as pd

In [53]:
import numpy as np

In [54]:
data=np.random.randn(4,3)

In [55]:
data

array([[ 1.25229085, -1.52671853, -0.65755561],
       [-0.20995695,  0.35301545,  0.02005286],
       [ 0.96912361,  0.14241046, -0.55709832],
       [ 0.84901604, -0.97406009, -0.18807392]])

In [56]:
data_frame=pd.DataFrame(data)

In [97]:
data_frame

          0         1         2
0  1.252291 -1.526719 -0.657556
1 -0.209957  0.353015  0.020053
2  0.969124  0.142410 -0.557098
3  0.849016 -0.974060 -0.188074

In [98]:
type(data_frame[0])

pandas.core.series.Series

In [99]:
type(data_frame)

pandas.core.frame.DataFrame

In [100]:
new_df = pd.DataFrame(data,index = ["Atil","Ayse","Ali","Veli"],columns=["Salary","Age","Seniority"])

In [101]:
new_df

        Salary       Age  Seniority
Atil  1.252291 -1.526719  -0.657556
Ayse -0.209957  0.353015   0.020053
Ali   0.969124  0.142410  -0.557098
Veli  0.849016 -0.974060  -0.188074

In [102]:
new_df["Age"]

Atil   -1.526719
Ayse    0.353015
Ali     0.142410
Veli   -0.974060
Name: Age, dtype: float64

In [103]:
new_df["Salary"]

Atil    1.252291
Ayse   -0.209957
Ali     0.969124
Veli    0.849016
Name: Salary, dtype: float64

In [104]:
new_df[["Age","Salary"]]

           Age    Salary
Atil -1.526719  1.252291
Ayse  0.353015 -0.209957
Ali   0.142410  0.969124
Veli -0.974060  0.849016

In [105]:
new_df.loc["Atil"]

Salary       1.252291
Age         -1.526719
Seniority   -0.657556
Name: Atil, dtype: float64

In [106]:
new_df.iloc[0]

Salary       1.252291
Age         -1.526719
Seniority   -0.657556
Name: Atil, dtype: float64

In [107]:
new_df.iloc[1]

Salary      -0.209957
Age          0.353015
Seniority    0.020053
Name: Ayse, dtype: float64

In [69]:
new_df.iloc[: 1]

        Salary       Age  Seniority
Atil  1.252291 -1.526719  -0.657556

In [108]:
new_df["Extra"]=10

In [110]:
new_df

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ayse -0.209957  0.353015   0.020053     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [111]:
new_df.drop("Extra", axis=1)

        Salary       Age  Seniority
Atil  1.252291 -1.526719  -0.657556
Ayse -0.209957  0.353015   0.020053
Ali   0.969124  0.142410  -0.557098
Veli  0.849016 -0.974060  -0.188074

In [112]:
new_df

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ayse -0.209957  0.353015   0.020053     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [113]:
new_df.drop("Ayse")

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [120]:
new_df

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [121]:
new_df.loc["Ali"]

Salary        0.969124
Age           0.142410
Seniority    -0.557098
Extra        10.000000
Name: Ali, dtype: float64

In [122]:
new_df.loc["Ali"]["Salary"]

np.float64(0.9691236118862703)

In [123]:
new_df.loc["Ali","Salary"]

np.float64(0.9691236118862703)

In [124]:
new_df.loc["Ali","Salary"]=1000

In [125]:
new_df

           Salary       Age  Seniority  Extra
Atil     1.252291 -1.526719  -0.657556     10
Ali   1000.000000  0.142410  -0.557098     10
Veli     0.849016 -0.974060  -0.188074     10

In [126]:
boolean_frame =new_df > 0

In [127]:
new_df[boolean_frame]

           Salary      Age  Seniority  Extra
Atil     1.252291      NaN        NaN     10
Ali   1000.000000  0.14241        NaN     10
Veli     0.849016      NaN        NaN     10

In [128]:
new_df[new_df>0]

           Salary      Age  Seniority  Extra
Atil     1.252291      NaN        NaN     10
Ali   1000.000000  0.14241        NaN     10
Veli     0.849016      NaN        NaN     10

In [130]:
new_df[new_df["Salary"]>1]

           Salary       Age  Seniority  Extra
Atil     1.252291 -1.526719  -0.657556     10
Ali   1000.000000  0.142410  -0.557098     10